## Baby Names! 
* Import Social Security card applications with the goal of hopefully determining and assigning gender to most actors, crew members, and producers
* Will use baby names from 1920 to present, in 30-year increments
* May need to add a third column for names that appear in lists for both genders
* I think these are all babies? Maybe they include adults applying for Social Security cards as well. 
* Curate final dataset with unique values only and create new .csv file to use in project and share with the world!

In [2]:
import csv
import pandas as pd
import numpy as np

In [3]:
f = open('yob1920.txt', 'r')
reader = csv.reader(f)

In [4]:
names_1920 = pd.read_csv('yob1920.txt')
names_1920.head()

       Mary  F  70980
0   Dorothy  F  36643
1     Helen  F  35097
2  Margaret  F  27997
3      Ruth  F  26101
4   Mildred  F  18058

In [6]:
columns = ['name', 'gender', 'number_of_bebes']
names_1920_second_attempt = pd.read_csv('yob1920.txt', header=None)
names_1920_second_attempt.head()

          0  1      2
0      Mary  F  70980
1   Dorothy  F  36643
2     Helen  F  35097
3  Margaret  F  27997
4      Ruth  F  26101

In [7]:
names_1920_second_attempt.shape

(10755, 3)

In [9]:
names_1920_second_attempt.columns = ['name', 'gender', 'xyz']

In [10]:
names_1920_second_attempt.tail()

           name gender  xyz
10750     Zearl      M    5
10751  Zeferino      M    5
10752      Zeke      M    5
10753      Zera      M    5
10754   Zygmont      M    5

In [13]:
# names_1920_second_attempt.drop('xyz', axis=1, inplace=True)

In [17]:
names_1920_second_attempt.replace({'F': 1, 'M': 0})
names_1920_second_attempt.head()

       name gender
0      Mary      F
1   Dorothy      F
2     Helen      F
3  Margaret      F
4      Ruth      F

#### Clean baby name df function
* Assign column names
* Drop the number of babies contained in column `xyz` 
* Change genders to binary
    * `F` $\rightarrow$ `1`
    * `M` $\rightarrow$ `0`

In [23]:
def clean_baby_df(df):
    df.columns = ['name', 'gender', 'xyz']
    df.drop('xyz', axis=1, inplace=True)
    df.gender.replace({'F': 1, 'M': 0})
    return df

In [16]:
# def txt_to_csv_to_clean_df(txt_file, df_name):
#     f = open(txt_file, 'r')
#     reader = csv.reader(f)
#     df_name = pd.read_csv(txt_file, header=None)
#     df_name.columns = ['name', 'gender', 'xyz']
#     df_name.drop('xyz', axis=1)
#     df_name.gender.replace({'F': 1, 'M': 0})

# this isn't working

In [22]:
f = open('yob1950.txt', 'r')
reader = csv.reader(f)
names_1950 = pd.read_csv('yob1950.txt')

In [24]:
clean_baby_df(names_1950)

            name gender
0           Mary      F
1       Patricia      F
2        Barbara      F
3          Susan      F
4          Nancy      F
5        Deborah      F
6         Sandra      F
7          Carol      F
8       Kathleen      F
9         Sharon      F
10         Karen      F
11         Donna      F
12        Brenda      F
13      Margaret      F
14         Diane      F
15        Pamela      F
16         Janet      F
17       Shirley      F
18       Carolyn      F
19        Judith      F
20        Janice      F
21       Cynthia      F
22     Elizabeth      F
23          Judy      F
24         Betty      F
25         Joyce      F
26     Christine      F
27        Cheryl      F
28        Gloria      F
29       Beverly      F
...          ...    ...
10271     Vannie      M
10272     Veldon      M
10273     Verdel      M
10274     Vertis      M
10275   Victoria      M
10276  Victorino      M
10277   Vincenzo      M
10278     Virgie      M
10279    Viviano      M
10280     Volney      M
10281    Vonzell      M
10282    Waynard      M
10283      Weber      M
10284  Wenceslao      M
10285  Whitfield      M
10286     Wilder      M
10287    Wilkins      M
10288       Wolf      M
10289   Woodford      M
10290    Woodroe      M
10291        Wyn      M
10292     Yaakov      M
10293      Yates      M
10294    Yisroel      M
10295   Zacarias      M
10296    Zachery      M
10297    Zackary      M
10298     Zannie      M
10299       Zeke      M
10300    Zygmunt      M

[10301 rows x 2 columns]